1s/ERP/Conf/Catalogs/Лико_Стеллажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Стеллажи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗонПриемкиОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСкладскихЯчеек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСекций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЯчеекВСекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПолный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШиринаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШиринаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинГлубинаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксГлубинаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Типоразмер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыСкладскихСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗоныПриемкиОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыСкладскихЯчеек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСкладскихЯчеек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаУчетОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СкладскиеСекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СкладскиеСекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыСкладскихСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАдресов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Места</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Стеллажи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти


#Область ПрограммныйИнтерфейс

Процедура ДобавлениеИзменениеТопологииСклада(Стеллаж) Экспорт
	
	
	
	
	//Стеллаж=Справочники.Лико_Стеллажи.СоздатьЭлемент();
	
	Структура = Новый Структура;
	Структура.Вставить("Склад", Стеллаж.Склад);
	Структура.Вставить("Родитель", Стеллаж.КаталогСкладскихЯчеек);
	
	КоличествоМест=Стеллаж.КоличествоСекций*Стеллаж.КоличествоЯчеекВСекции;
	Структура.Вставить("КоличествоМест", КоличествоМест);
	Структура.Вставить("Ряд", Стеллаж.Код); 
	Структура.Вставить("РядДоп", Стеллаж.КодДоп);
	Структура.Вставить("СМест", 1); 
	Структура.Вставить("ПОМест", КоличествоМест); 
	КоличествоЭтажей = Стеллаж.Этажи.Количество();
	Структура.Вставить("КоличествоЭтажей", КоличествоЭтажей);
	Структура.Вставить("СЭтажей", 1);
	Структура.Вставить("ПоЭтажей", КоличествоЭтажей);
	Структура.Вставить("НаименованиеМеста", "Место");
	Структура.Вставить("НаименованиеЭтажа", "Этаж");

	
	НачатьТранзакцию();	
	СоздатьТопологиюЯчеек(Структура);
	СоздатьТопологиюСекций(Стеллаж);
	СоздатьТопологиюЗоныПриемкиИОтгрузки(Стеллаж,Структура);
	ЗафиксироватьТранзакцию();	
	
	
	
КонецПроцедуры
 
Функция ЦветаСтелажей(Склад)Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Стеллажи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Стеллажи КАК Лико_Стеллажи
	|ГДЕ
	|	Лико_Стеллажи.Склад = &Склад";
	Запрос.УстановитьПараметр("Склад",Склад );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Соответствие = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		ДопНастройки=Выборка.Ссылка.ДопНастройки.Получить();  
		
		Если   ТипЗнч(ДопНастройки)=Тип("Структура") Тогда
			
			ДопНастройки.Свойство("ЦветСтеллажа");		   
			Соответствие.Вставить(Выборка.Ссылка, ДопНастройки.ЦветСтеллажа);
			
			
		КонецЕсли;
		
		
	КонецЦикла; 
	
	
	Возврат Соответствие;
	
	
КонецФункции  


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьТопологиюЯчеек(СтруктураПараметров)
	НачатьТранзакцию();	
	Ряд=СоздатьПолучитьРяд(СтруктураПараметров);
	ОбработатьМеста(Ряд,СтруктураПараметров);
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СоздатьТопологиюСекций(Стеллаж) 
	
	Справочники.Лико_СкладскиеСекции.ДобавлениеИзменениеСекций(Стеллаж);
	
КонецПроцедуры 

Процедура СоздатьТопологиюЗоныПриемкиИОтгрузки(Стеллаж,СтруктураПараметров)
	
	Ряд=СоздатьПолучитьРяд(СтруктураПараметров);
	
	
	СтеллажОбъект =  Стеллаж.ПолучитьОбъект();
	СтеллажОбъект.ЗоныПриемкиОтгрузки.Очистить();
	
	НомерПола=1;

	ПолМесто = СозатьРедактироватьПолМесто(Ряд,СтруктураПараметров);

	Пока НомерПола<= Стеллаж.КоличествоЗонПриемкиОтгрузки Цикл
		
				ПолАдрес = СоздатьРедактироватьПолАдрес(ПолМесто,СтруктураПараметров,НомерПола);
		
		НоваяЗона = 	СтеллажОбъект.ЗоныПриемкиОтгрузки.Добавить();
		
		НоваяЗона.АдресХранения=ПолАдрес;		
		НомерПола=НомерПола+1;

	КонецЦикла;	
	
	СтеллажОбъект.Записать();
	 
КонецПроцедуры



Функция СозатьРедактироватьПолМесто(Ряд,Объект)
	
	КодУПП = "99";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Родитель = &Родитель
	|	И СкладскиеЯчейки.Лико_КодУПП = &КодУПП
	|	И СкладскиеЯчейки.ЭтоГруппа";
	Запрос.УстановитьПараметр("Родитель",Ряд ); 
	Запрос.УстановитьПараметр("КодУПП",КодУПП );
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат  Выборка.Ссылка;
		
	КонецЦикла; 
	
	
	
	Место=Справочники.СкладскиеЯчейки.СоздатьГруппу();
	Код=СокрЛП(Ряд.Наименование)+", ПОЛ";
	
	СпрОбъект=Место;
	СпрОбъект.Родитель=Ряд;
	СпрОбъект.Владелец		=Объект.Склад;
	СпрОбъект.Наименование	=Код;
	СпрОбъект.Код			=Код;
	СпрОбъект.Лико_КодУПП	=КодУПП;
	СпрОбъект.Лико_ИдУПП	=Код;
	СпрОбъект.Лико_ПолноеНаименованиеУПП=СокрЛП(Ряд.Наименование)+", "+Код;
	СпрОбъект.ОбменДанными.Загрузка=Истина;
	СпрОбъект.Записать();
	
	Возврат Место.Ссылка;
	
КонецФункции

Функция СоздатьРедактироватьПолАдрес(ПолМесто,Объект,НомерПола)
	
	КодУПП = Формат(НомерПола,"ЧЦ=2; ЧВН=");
	
	   Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Родитель = &Родитель
	|	И СкладскиеЯчейки.Лико_КодУПП = &КодУПП
	|	И НЕ СкладскиеЯчейки.ЭтоГруппа";
	Запрос.УстановитьПараметр("Родитель",ПолМесто ); 
	Запрос.УстановитьПараметр("КодУПП",КодУПП );
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат  Выборка.Ссылка;
		
	КонецЦикла; 

	
	
			Ячейка=Справочники.СкладскиеЯчейки.СоздатьЭлемент();
		//Номер=Формат(м, "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=");
	Наименование=СтрШаблон("%1-%2",ПолМесто.Код,НомерПола);
	Код=Наименование;
	
	
	СпрОбъект=Ячейка;
	СпрОбъект.Типоразмер=Справочники.ТипоразмерыЯчеек.НайтиПоНаименованию("Ячейка");
	СпрОбъект.ТипСкладскойЯчейки=Перечисления.ТипыСкладскихЯчеек.Хранение;
	СпрОбъект.Родитель		=ПолМесто;
	СпрОбъект.Владелец		=Объект.Склад;
	СпрОбъект.УровеньДоступности=1;
	СпрОбъект.МаксимальныйКоэффициентНаполненностиПоВесу=100;
	СпрОбъект.МаксимальныйКоэффициентНаполненностиПоОбъему=100;
	СпрОбъект.Наименование	=Наименование;
	СпрОбъект.Код			=Код;
	СпрОбъект.Лико_КодУПП	=КодУПП;
	СпрОбъект.Лико_ИдУПП	=Код;
	СпрОбъект.Лико_ПолноеНаименованиеУПП=Код;
	СпрОбъект.Записать();
	Возврат СпрОбъект.Ссылка; 
	
КонецФункции





Процедура ОбработатьМеста(Ряд, Объект)
	
	МассивМестПред=ПолучитьМеста(Ряд);
	МассивМест=ОбработатьМассив(МассивМестПред);
	ОбходМассиваМест=Истина;
	м=1;
	Создано=0;

	Пока м<=Объект.КоличествоМест Цикл
		
		Если ОбходМассиваМест Тогда	
			ОбходМассиваМест=Ложь;	
			Для каждого Место Из МассивМест Цикл				
				Если м <=Объект.КоличествоМест Тогда
					Если м >=Объект.СМест и м<=Объект.ПОМест Тогда
						СоздатьРедактироватьМесто(Объект,Ряд,м,Место);
						Создано=Создано+1;

					КонецЕсли;
				Иначе
					Прервать;
				КонецЕсли; 
				м=м+1;					
			КонецЦикла;
			Если м=1 Тогда
				Если м >=Объект.СМест и м<=Объект.ПОМест Тогда
					
					СоздатьРедактироватьМесто(Объект,Ряд,м); 
					Создано=Создано+1;

				КонецЕсли;
				м=2;				
			КонецЕсли;			
		Иначе
			Если м >=Объект.СМест и м<=Объект.ПОМест Тогда
				
				СоздатьРедактироватьМесто(Объект,Ряд,м); 
				Создано=Создано+1;

			КонецЕсли;
			м=м+1;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Функция ОбработатьМассив(МассивМест)
	Массив = Новый Массив();
	
	Сч=1;
	Для каждого СтрМассив Из МассивМест Цикл
		Дельта=Число(СтрМассив.Лико_КодУПП)-Сч;
		Если Дельта<>0 Тогда
			
			Для Сч2=1 По Дельта Цикл 
				Массив.Добавить(Неопределено);
				Сч=Сч+1;
			КонецЦикла;
		КонецЕсли;
		Массив.Добавить(СтрМассив);
		Сч=Сч+1;
		
	КонецЦикла;
	Возврат Массив;	
КонецФункции


Функция ПолучитьМеста(Ряд)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка,
	|	СкладскиеЯчейки.Лико_КодУПП КАК Лико_КодУПП
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Родитель = &Родитель
	|	И СкладскиеЯчейки.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладскиеЯчейки.Лико_КодУПП";
	Запрос.УстановитьПараметр("Родитель",Ряд );
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
	
КонецФункции


Функция ПолучитьЯчейку(Этаж)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка,
	|	СкладскиеЯчейки.Лико_КодУПП КАК Лико_КодУПП
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладскиеЯчейки.Лико_КодУПП";
	Запрос.УстановитьПараметр("Родитель",Этаж );
	РезультатЗапроса= Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	
	
КонецФункции



Процедура СоздатьРедактироватьМесто(Объект,Ряд,м,Место=Неопределено)
	Если Место=Неопределено Тогда
		Место=Справочники.СкладскиеЯчейки.СоздатьГруппу();
	Иначе
		Место=Место.ПолучитьОбъект();
	КонецЕсли;
	Номер=Формат(м, "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=");
	Наименование=СокрЛП(Объект.НаименованиеМеста)+" №"+Номер;
	Код=СокрЛП(Ряд.Наименование)+", "+СокрЛП(Объект.НаименованиеМеста)+" №"+Номер+"("+Номер+")";
	КодУПП=Номер;
	
	СпрОбъект=Место;
	СпрОбъект.Родитель=Ряд;
	СпрОбъект.Владелец		=Объект.Склад;
	СпрОбъект.Наименование	=Наименование;
	СпрОбъект.Код			=Код;
	СпрОбъект.Лико_КодУПП	=КодУПП;
	СпрОбъект.Лико_ИдУПП	=Код;
	СпрОбъект.Лико_ПолноеНаименованиеУПП=СокрЛП(Ряд.Наименование)+", "+Наименование;
	СпрОбъект.ОбменДанными.Загрузка=Истина;
	СпрОбъект.Записать();
	
	ОбработатьЭтажи(Объект,Место.Ссылка,Ряд);	
	
КонецПроцедуры


Процедура СоздатьРедактироватьЭтаж(Объект,Ряд,Место,м,Этаж=Неопределено)
	Если Этаж=Неопределено Тогда
		Этаж=Справочники.СкладскиеЯчейки.СоздатьГруппу();
	Иначе
		Этаж=Этаж.ПолучитьОбъект();
	КонецЕсли;
	Номер=Формат(м, "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=");
	Наименование=СокрЛП(Объект.НаименованиеЭтажа)+" №"+Номер;
	Код=СокрЛП(Ряд.Наименование)+", "+СокрЛП(Место.Наименование)+", " +Наименование+"("+Номер+")";
	КодУПП=Номер;
	
	СпрОбъект=Этаж;
	СпрОбъект.Родитель		=Место;
	СпрОбъект.Владелец		=Объект.Склад;
	СпрОбъект.Наименование	=Наименование;
	СпрОбъект.Код			=Код;
	СпрОбъект.Лико_КодУПП	=КодУПП;
	СпрОбъект.Лико_ИдУПП	=Код;
	СпрОбъект.Лико_ПолноеНаименованиеУПП=СокрЛП(Ряд.Наименование)+", "+СокрЛП(Место.Наименование)+", "+Наименование;
	СпрОбъект.Записать();
	ОбработатьЯчейки(Объект,СпрОбъект.Ссылка);
	
КонецПроцедуры


Процедура ОбработатьЯчейки(Объект,Этаж)
	
	МассивЯчеек=ПолучитьЯчейку(Этаж);
	СоздатьРедактироватьЯчейку(Объект,Этаж,ПолучитьЯчейку(Этаж)); 
	
	
КонецПроцедуры



Процедура СоздатьРедактироватьЯчейку(Объект,Этаж,Ячейка)
	Если Ячейка=Неопределено Тогда
		Ячейка=Справочники.СкладскиеЯчейки.СоздатьЭлемент();
	Иначе
		Ячейка=Ячейка.ПолучитьОбъект();
	КонецЕсли;
	//Номер=Формат(м, "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=");
	Наименование=ПолучитьКодПоРодителю(Объект,Этаж);
	Код=Наименование;
	КодУПП="01";
	
	СпрОбъект=Ячейка;
	СпрОбъект.Типоразмер=Справочники.ТипоразмерыЯчеек.НайтиПоНаименованию("Ячейка");
	СпрОбъект.ТипСкладскойЯчейки=Перечисления.ТипыСкладскихЯчеек.Хранение;
	СпрОбъект.Родитель		=Этаж;
	СпрОбъект.Владелец		=Объект.Склад;
	СпрОбъект.УровеньДоступности=1;
	СпрОбъект.МаксимальныйКоэффициентНаполненностиПоВесу=100;
	СпрОбъект.МаксимальныйКоэффициентНаполненностиПоОбъему=100;
	СпрОбъект.Наименование	=Наименование;
	СпрОбъект.Код			=Код;
	СпрОбъект.Лико_КодУПП	=КодУПП;
	СпрОбъект.Лико_ИдУПП	=СокрЛП(Этаж.Лико_ПолноеНаименованиеУПП)+", "+Код+"(01)";
	СпрОбъект.Лико_ПолноеНаименованиеУПП=СокрЛП(Этаж.Лико_ПолноеНаименованиеУПП)+", "+Код;
	СпрОбъект.Записать();
	
КонецПроцедуры
	
Функция ПолучитьКодПоРодителю(Объект,Родитель);
	Код=Родитель.Лико_ПолноенаименованиеУПП;
	Код=СтрЗаменить(Код,"Ряд","Р");
	Код=СтрЗаменить(Код,"№0","");
	Код=СтрЗаменить(Код,"№","");
	Код=СтрЗаменить(Код,",","");
	Код=СтрЗаменить(Код," ","");
	//Код=СтрЗаменить(Код,"0","");	
	Код=СтрЗаменить(Код,СокрЛП(Объект.НаименованиеМеста),Лев(Объект.НаименованиеМеста,1));
	Код=СтрЗаменить(Код,СокрЛП(Объект.НаименованиеЭтажа),Лев(Объект.НаименованиеЭтажа,1));
	
	Возврат Код;
	
	
	
КонецФункции




Процедура ОбработатьЭтажи(Объект,Место,Ряд)
	МассивЭтажей=ПолучитьМеста(Место);
	ОбходМассиваЭтажей=Истина;
	м=1;
	Создано=0;
	Пока м<= Объект.КоличествоЭтажей Цикл
		Если ОбходМассиваЭтажей Тогда	
			ОбходМассиваЭтажей=Ложь;	
			Для каждого Этаж Из МассивЭтажей Цикл
				Если м <=Объект.КоличествоЭтажей Тогда
					Если м >=Объект.СЭтажей и м<=Объект.ПоЭтажей Тогда
						
						СоздатьРедактироватьЭтаж(Объект,Ряд,Место,м,Этаж);
						Создано=Создано+1;
					КонецЕсли;
					
				Иначе
					Прервать;
				КонецЕсли;
				м=м+1;	
				
			КонецЦикла;
			Если м=1 ТОгда
				Если м >=Объект.СЭтажей и м<=Объект.ПоЭтажей Тогда
					
					СоздатьРедактироватьЭтаж(Объект,Ряд,Место,м);
					Создано=Создано+1;
				КонецЕсли;
				м=2;
			КонецЕсли;
			
			
		Иначе
			Если м >=Объект.СЭтажей и м<=Объект.ПоЭтажей Тогда
				
				СоздатьРедактироватьЭтаж(Объект,Ряд,Место,м);
				Создано=Создано+1;
			КонецЕсли;
			м=м+1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры



Функция СоздатьПолучитьРяд(Объект)
	РядПолный = Объект.Ряд+Объект.РядДоп;
	РядПолныйДлина = СтрДлина(РядПолный);
	РядНаименование="Ряд №"+Формат(Объект.Ряд+Объект.РядДоп, "ЧЦ="+РядПолныйДлина+"; ЧДЦ=0; ЧВН=; ЧГ=");
	РядКод=РядНаименование+"("+Формат(Объект.Ряд+Объект.РядДоп,  "ЧЦ="+РядПолныйДлина+"; ЧДЦ=0; ЧВН=; ЧГ=")+")";
	КодУПП=Формат(Объект.Ряд,  "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Лико_ПолноеНаименованиеУПП = &КодУПП
	|	И СкладскиеЯчейки.Родитель = &Родитель";
	Запрос.УстановитьПараметр("КодУПП",РядНаименование );
	Запрос.УстановитьПараметр("Родитель",Объект.Родитель );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
			СпрОбъект=Справочники.СкладскиеЯчейки.СоздатьГруппу();
		СпрОбъект.Родитель= Объект.Родитель;
		СпрОбъект.Владелец		=Объект.Склад;
		СпрОбъект.Наименование	=РядНаименование;
		СпрОбъект.Код			=РядКод;
		СпрОбъект.Лико_КодУПП	=КодУПП;
		СпрОбъект.Лико_ИдУПП	=РядКод;
		СпрОбъект.Лико_ПолноеНаименованиеУПП=РядНаименование;
		СпрОбъект.Записать();
		Возврат СпрОбъект.Ссылка;
		
КонецФункции


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
